Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkTagAttributes.ShowOnSide Property
 The side(s) on which the tag is shown.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SectionMarkBase.SectionMarkTagAttributes.TagShowOnSide ShowOnSide { get; set; }
Public Property ShowOnSide As SectionMarkBase.SectionMarkTagAttributes.TagShowOnSide
	Get
	Set
Property Value
Type: SectionMarkBase.SectionMarkTagAttributes.TagShowOnSide
See Also
Reference
SectionMarkBase.SectionMarkTagAttributes Class
Tekla.Structures.Drawing Namespace